# Module 1 - Introduction to Pandas
## Pandas Part 1

### Introduction

![austin](http://www.austintexas.gov/sites/default/files/aac_logo.jpg)
You have decided that you want to start your own animal shelter, but you want to get an idea of what that will entail and get more information about planning. You have found out that Austin has one of the largest no-kill animal shelters in the country, and they keep meticulous track of animals that have been taken in and released. However, it is a large file, the online visualization tools provided are terrible, the data is sorted as strings, and the file holds an overwhelming amount  of information. Is there an easy way to look at this data? Can we do this with base Python? Is there a better way?


#### _Our goals today are to be able to_: <br/>

- Import/read data using Pandas
- Identify Pandas objects and manipulate Pandas objects by index and columns
- Filter data using Pandas

#### _Big questions for this lesson_: <br/>
- Why use Pandas? 
 
 (a) Provides methods able analyze data stored in the format Data Scientist most often encounter (.csv, .tsv, or .xlsx). 
 
 (b) Makes it very convenient to load, process, and analyze in the aforementioned formats. 
 
 (c) Along with python visualization packages allows for the visual analysis of tabular data.
 

- When do we want to use NumPy versus Pandas?
- What are the advantages of using Pandas?    
https://stackabuse.com/beginners-tutorial-on-the-pandas-python-library/
- What are the disadvantages of using Pandas?                      
https://wesmckinney.com/blog/apache-arrow-pandas-internals/

- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### Activation:

<img src="https://cdn-images-1.medium.com/max/1600/1*9IU5fBzJisilYjRAi-f55Q.png" width=700, height=700>  




- The data manipulation capabilities of pandas are built on top of the numpy library.
- Pandas dataframe object represents a spreadsheet with cell values, column names, and row index labels.

### 1. Importing and reading data with Pandas!

#### Let's use pandas to read some csv files so we can interact with them.

In [1]:
# First, let's check which directory we are in so the files we expect to see are there.
!pwd
!ls -al

/Users/phoebe/FlatIron/dc_ds_06_03_19/module_1/week_1/day_5_lecture_1_pandas
total 216
drwxr-xr-x  8 phoebe  staff    256 Jun  7 13:04 .
drwxr-xr-x  7 phoebe  staff    224 Jun  7 13:04 ..
drwxr-xr-x  2 phoebe  staff     64 Jun  7 13:04 .ipynb_checkpoints
-rw-r--r--  1 phoebe  staff     62 Jun  7 13:04 example1.csv
-rw-r--r--  1 phoebe  staff  63117 Jun  7 13:04 excelpic.jpg
-rw-r--r--  1 phoebe  staff  25872 Jun  7 13:04 intro_to_pandas.ipynb
-rw-r--r--  1 phoebe  staff   6782 Jun  7 13:04 lesson_plan.md
-rw-r--r--  1 phoebe  staff    238 Jun  7 13:04 made_up_jobs.csv

In [3]:
import pandas as pd
pd.set_option("display.precision", 2)
example_csv=pd.read_csv('example1.csv')

There is also `read_excel` and many other pandas `read` functions.  
http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

In [4]:
example_csv.head()

     Title1    Title2    Title3
0       one       two     three
1  example1  example2  example3

Try loading in the example file in the directory called 'made_up_jobs.csv' using pandas.

In [5]:
#read in your csv here!
made_up=pd.read_csv('made_up_jobs.csv')
made_up.head()

#remember that it's nice to be able to look at your data, so let's do that here, too.

   ID           Name                       Job  Years Employed
0   0   Bob Bobberty  Underwater Basket Weaver              13
1   1   Susan Smells             Salad Spinner               5
2   2  Alex Lastname      Productivity Manager               2
3   3        Rudy P.                Being cool              55
4   4        Rudy G.  Being compared to Rudy P              50

You can also load in data by using the url of an associated dataset.

In [8]:
shelter_data=pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD') 
#this link is copied directly from the download option for CSV

shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A796597,NaN,06/07/2019 10:56:00 AM,06/07/2019 10:56:00 AM,06/03/2014,Euthanasia,Suffering,Dog,Intact Male,5 years,German Shepherd Mix,Brown
1,A796906,NaN,06/07/2019 10:46:00 AM,06/07/2019 10:46:00 AM,06/07/2014,Euthanasia,Suffering,Cat,Unknown,NaN,Domestic Shorthair,Blue/White
2,A796905,NaN,06/07/2019 10:27:00 AM,06/07/2019 10:27:00 AM,06/07/2017,Euthanasia,Suffering,Other,Unknown,2 years,Raccoon,Black/Gray
3,A796904,NaN,06/07/2019 08:48:00 AM,06/07/2019 08:48:00 AM,05/07/2019,Euthanasia,At Vet,Cat,Unknown,4 weeks,Domestic Shorthair,Black
4,A795041,*Galadriel,06/07/2019 07:51:00 AM,06/07/2019 07:51:00 AM,04/24/2019,Disposal,NaN,Cat,Intact Female,1 month,Domestic Shorthair,Tortie

Now that we can read in data, let's get more comfortable with our Pandas data structures.

In [10]:
len(shelter_data)

101278

In [9]:
type(shelter_data)

pandas.core.frame.DataFrame

In [11]:
# Now that data is read let's look at it's shape
print(shelter_data.shape)

(101278, 12)

In [12]:
#What are the names of the columns
print(shelter_data.columns)

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [13]:
#What are the different data types present in our data
print(shelter_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 101278 entries, 0 to 101277
Data columns (total 12 columns):
Animal ID           101278 non-null object
Name                69737 non-null object
DateTime            101278 non-null object
MonthYear           101278 non-null object
Date of Birth       101278 non-null object
Outcome Type        101271 non-null object
Outcome Subtype     46026 non-null object
Animal Type         101278 non-null object
Sex upon Outcome    101276 non-null object
Age upon Outcome    101263 non-null object
Breed               101278 non-null object
Color               101278 non-null object
dtypes: object(12)
memory usage: 9.3+ MB
None

In [14]:
# We can find the type of a particular columns in a data frame in this way.
ID_series=shelter_data['Animal ID'] 
shelter_data['Animal ID'].dtypes

dtype('O')

### 2. Utilizing and identifying Pandas objects

- What is a DataFrame object and what is a Series object? 
- How are they different from Python lists?

These are questions we will cover in this section. To start, let's start with this list of fruits.

In [15]:
#define your list here!

fruits = ['Apple','Orange','Watermelon','Lemon','Mango']

print(fruits)

['Apple', 'Orange', 'Watermelon', 'Lemon', 'Mango']

Using our list of fruits, we can create a pandas object called a 'series' which is much like an array or a vector.

In [16]:
fruits_series = pd.Series(fruits)

print(fruits_series)
type(fruits_series)

0         Apple
1        Orange
2    Watermelon
3         Lemon
4         Mango
dtype: object

pandas.core.series.Series

One difference between python **list objects** and pandas **series objects** is the fact that you can define the index manually for a **series objects**.

In [75]:
ind = ['a','b','c','d','e']

fruits_series = pd.Series(fruits,index=ind)

#index doesn't have to be unique

print(fruits_series)

a         Apple
b        Orange
c    Watermelon
d         Lemon
e         Mango
dtype: object

With a partner, create your own custom series from a list of lists.

In [ ]:
list_of_lists=[['cat'],['dog'],['horse'],['cow'],['macaw']]

#create custom indices for your series


#create the series using your list objects
#for loop
lls = []
for i in range(0,len(ind)):
    ind1=ind[i]
    lls1=list_of_lists[i]
    lls[i]=[ind1,lls1]
print(lls)

In [78]:
#You can use either a for loop or also pd.Series
list_of_lists_series = pd.Series(list_of_lists,index=ind)

#print your series
print(list_of_lists_series )
type(list_of_lists_series)

a      [cat]
b      [dog]
c    [horse]
d      [cow]
e    [macaw]
dtype: object

pandas.core.series.Series

In [79]:
list_of_lists_series

a      [cat]
b      [dog]
c    [horse]
d      [cow]
e    [macaw]
dtype: object

In [90]:
list_of_lists_series.loc[["b"],[0]]

IndexingError: Too many indexers

We can do a simliar thing with Python dictionaries. This time, however, we will create a DataFrame object from a python dictionary.

In [31]:
# Dictionary with list object in values
student_dict = {
    'name' : ['Samantha', 'Alex', 'Dante'],
    'age' : ['35','17','26'],
    'city' : ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

students_df.head()

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [33]:
#to find data types of columns
students_df.dtypes

name    object
age     object
city    object
dtype: object

Let's change the data type of ages to int.

In [34]:
# We can also change a columns type but the change has to make sense.
students_df.age = students_df.age.astype(int)

#Uncomment line below and observe what happens when trying to convert student's name to int or float
#students_df.name = students_df.name.astype(int)

#How about what happens converting numeric to string
#students_df.age = students_df.age.astype(str)

students_df.dtypes

name    object
age      int64
city    object
dtype: object

We can also use a custom index for these items. For example, we might want them to be the individual student ID numbers.

In [35]:
school_ids = ['1111','1145','0096']

#Notice here we use pd.DataFrame not pd.Series as we did for a pandas series.
students_df = pd.DataFrame(student_dict,index=school_ids)

students_df.head()

          name age      city
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Using Pandas, we can also rename column names.

In [36]:
students_df.columns = ['NAME', 'AGE','HOME']
students_df.head()

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

Or, we can also change the column names using the rename function.

In [37]:
students_df.rename(columns={'AGE': 'YEARS'})

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [38]:
# Notice what happens when we print students_df

students_df

          NAME AGE      HOME
1111  Samantha  35   Houston
1145      Alex  17   Seattle
0096     Dante  26  New york

In [39]:
#If you want the file to save over itself, use the option `inplace = True`.
students_df.rename(columns={'AGE': 'YEARS'}, inplace=True)
students_df.head()

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

Similarly, there is a tool to remove rows and columns from your DataFrame

In [40]:
students_df.drop(columns=['YEARS', 'HOME'])

          NAME
1111  Samantha
1145      Alex
0096     Dante

In [41]:
#Notice again what happens if we print students_df 
students_df

          NAME YEARS      HOME
1111  Samantha    35   Houston
1145      Alex    17   Seattle
0096     Dante    26  New york

In [ ]:
students_df.drop(columns=['YEARS', 'HOME'], inplace=True)
students_df

If you want the file to save over itself, use the option `inplace = True`.

Every function has options. Let's read more about `drop` [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html)

### 3. Filtering Data Using Pandas
There are several ways to grab particular data from a DataFrame. 
- Python lists allow for selection of data only through integer location. 
- You can use a single integer or slice notation to make the selection but NOT a list of integers.
- Dictionaries only allow selection with a single label. Slices and lists of labels are not allowed.

In [43]:
l=[1,2,3,4,5]
l[[0,5]]

TypeError: list indices must be integers or slices, not list

### DataFrames can be indexed by column name (label) or row name (index) or by position.   
#### The `.loc` method is used for indexing by name.  
#### While `.iloc` is used for indexing by number.

In [52]:
student_dict = {
    'name' : ['Samantha', 'Alex', 'Dante'],
    'age' : ['35','17','26'],
    'city' : ['Houston', 'Seattle', 'New york']
}

students_df = pd.DataFrame(student_dict)

In [53]:
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

### Let's take a look at `.iloc`
#### `.iloc` takes slices based on index position.
#### `.iloc` stands for integer location so that should help with remember what it does
#### `.iloc`[row , column]

In [46]:
#returns the first row
students_df.iloc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [47]:
#returns the first column
students_df.iloc[:,0]

0    Samantha
1        Alex
2       Dante
Name: name, dtype: object

In [48]:
#returns first two rows notice that ILOC performs regular python slicing.
students_df.iloc[0:2]

       name age     city
0  Samantha  35  Houston
1      Alex  17  Seattle

In [49]:
#returns the first two columns
students_df.iloc[:,0:2]

       name age
0  Samantha  35
1      Alex  17
2     Dante  26

In [50]:
# returns first row and columns 1 and 2
students_df.iloc[0:1,0:2]

       name age
0  Samantha  35

### How would we use `.iloc` to return the last item in the last row?

In [59]:
#return the last item in the last row using iloc
students_df.iloc[-1,:]

name       Dante
age           26
city    New york
Name: 2, dtype: object

In [65]:
#return the last item in the last row using iloc
students_df.iloc[:,:]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

### How would we use `.iloc` to return the last item in the last column?

In [60]:
#return the last item in the last column using iloc
students_df.iloc[:,-1]

0     Houston
1     Seattle
2    New york
Name: city, dtype: object

### What if we only want certain columns or rows?

In [67]:
## Don't do students_df.iloc[0, 2]
students_df.iloc[0,2]

'Houston'

In [63]:
## Don't do students_df.iloc[0, 2]
students_df.iloc[:,[0,2]]

       name      city
0  Samantha   Houston
1      Alex   Seattle
2     Dante  New york

In [66]:
## Don't do students_df.iloc[0, 2]
students_df.iloc[[0,2]]

       name age      city
0  Samantha  35   Houston
2     Dante  26  New york

In [64]:
students_df.iloc[[0,2],[0,2]]

       name      city
0  Samantha   Houston
2     Dante  New york

### Let's take a look at `.loc`
#### Label based method. 
#### Names or labels of the index is used when taking slices.
#### Also supports boolean subsetting.

In [68]:
# We will use loc to return rows and columns based on labels. Let's look at the students_df DataFrame again.
students_df

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [69]:
#returns the student information associated with index 0
students_df.loc[0]

name    Samantha
age           35
city     Houston
Name: 0, dtype: object

In [70]:
#returns the student information for row index 0 to 2 inclusive.
#note iloc would return normal python slicing not including 2 as demonstrated above.
students_df.loc[0:2]

       name age      city
0  Samantha  35   Houston
1      Alex  17   Seattle
2     Dante  26  New york

In [71]:
#returns the column labeled 'age'
students_df.loc[:,'age']

0    35
1    17
2    26
Name: age, dtype: object

In [82]:
#returns the column labeled 'age' and index values 1 to 2.
#gives us the values of the rows with index from 1 to 2 (inclusive)
#and columns labeled age"
students_df.loc[1:2,'age']

1    17
2    26
Name: age, dtype: object

In [83]:
#returns the column labeled 'age' and index values 1 to 2.
#gives us the values of the rows with index from 1 to 2 (inclusive)
#and columns labeled age to city (inclusive)"
students_df.loc[1:2,'age':'city']

  age      city
1  17   Seattle
2  26  New york

In [84]:
#What should we get?
students_df.loc[1:2,['name', 'city']]

    name      city
1   Alex   Seattle
2  Dante  New york

In [85]:
#How about? 
students_df.loc[[0,2],['name', 'city']]

       name      city
0  Samantha   Houston
2     Dante  New york

In [86]:
#if index rearranged
school_ids = ['5','11','3']
students_df = pd.DataFrame(student_dict,index=school_ids)

In [87]:
#What should we get now?
students_df.loc[[0,2],['name', 'city']]

KeyError: "None of [Int64Index([0, 2], dtype='int64')] are in the [index]"

In [88]:
#What should we get now?
students_df.loc[['5','11'],['name', 'city']]

        name     city
5   Samantha  Houston
11      Alex  Seattle

In [99]:
students_df.set_index("name", inplace=True)
students_df

         age      city       state
name
Samantha  35   Houston       Texas
Alex      17   Seattle  Washington
Dante     26  New york    New York
Samantha  21   Atlanta     Georgia

In [100]:
students_df.loc[['Samantha']]

         age     city    state
name
Samantha  35  Houston    Texas
Samantha  21  Atlanta  Georgia

In [ ]:
#Subsetting nonconsecutive rows
students_df.loc[['Samantha','Dante']]

In [ ]:
#Samantha to the end
students_df.loc['Samantha':]

In [ ]:
#return the first and last rows using one loc command

### Boolean Subsetting

In [91]:
student_dict = {
    'name' : ['Samantha', 'Alex', 'Dante','Samantha'],
    'age' : ['35','17','26','21'],
    'city' : ['Houston', 'Seattle', 'New york','Atlanta'],
    'state' :['Texas', 'Washington','New York','Georgia']
}

students_df = pd.DataFrame(student_dict)

In [92]:
#The statement data[name] == Samantha] produces a Pandas Series with a True/False value for every row 
#in the data DataFrame, where there are True values for the rows where the name is Samantha. 
#These type of boolean arrays can be passed directly to the .loc indexer.
students_df.loc[students_df['name']=='Samantha']

       name age     city    state
0  Samantha  35  Houston    Texas
3  Samantha  21  Atlanta  Georgia

In [93]:
#What about if we only want the city and state of the selected students with the name Samantha?
students_df.loc[students_df['name']=='Samantha',['city','state']]

      city    state
0  Houston    Texas
3  Atlanta  Georgia

In [94]:
#What amount if we want to select a student of a specific age? 
students_df.loc[students_df['age']=='21']

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [95]:
#What amount if we want to select a student of a specific age? 
students_df.loc[(students_df['age']=='21') & (students_df['city']=='Atlanta')]

       name age     city    state
3  Samantha  21  Atlanta  Georgia

In [96]:
#What should be returned? 
students_df.loc[(students_df['age']=='35') & (students_df['city']=='Atlanta')]

Empty DataFrame
Columns: [name, age, city, state]
Index: []

### Lesson Recap
Pandas combines the power of python lists (selection via integer location) and dictionaries (selection by label)

`.iloc` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

`.iloc` will raise IndexError if a requested indexer is out-of-bounds, except slice indexers which allow out-of-bounds indexing (this conforms with python/numpy slice semantics).

`.loc` is primarily label based, but may also be used with a boolean array.

#### Warning Note that contrary to usual python slices, both the start and the stop are included.

`.loc` will raise a keyError when any items are not found.

### Pandas
- The data structures in Pandas are implemented using series and dataframe classes.  
- A series is a one-dimensional indexed array of some fixed data type.  
- While a dataframe is a two-dimensional data structure like a table where each column contains data of the same type.  
- DataFrames are great for representing real data: rows correspond to instances (examples, observations, etc.), and columns correspond to features of these instances.

### CLASS ASSIGNMENT
Now that we have all of these new tools in our tool belt, use these tools on the shelter data set! 
- Use `shelter_data.columns` to get the list of column names.
- Subset the data by '`Outcome Subtype`.
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column. 
- Subset the data by '`Outcome Subtype` `Adoption` and only return the `Animal Type` column with only `Cat`. 
- Play around with your new tools on the data set.
- For extra credit: What are the data types returned from the different subsetting? Is what returned a series or dataframe?

In [97]:
import pandas as pd
shelter_data=pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD') 
shelter_data.head()

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A793212,*Jelly Bean,06/07/2019 11:27:00 AM,06/07/2019 11:27:00 AM,03/10/2019,Adoption,Foster,Dog,Neutered Male,2 months,Plott Hound Mix,Tricolor
1,A796843,Jordan,06/07/2019 11:18:00 AM,06/07/2019 11:18:00 AM,06/06/2017,Return to Owner,NaN,Dog,Intact Female,2 years,Doberman Pinsch,Brown/Tan
2,A796597,NaN,06/07/2019 10:56:00 AM,06/07/2019 10:56:00 AM,06/03/2014,Euthanasia,Suffering,Dog,Intact Male,5 years,German Shepherd Mix,Brown
3,A796906,NaN,06/07/2019 10:46:00 AM,06/07/2019 10:46:00 AM,06/07/2014,Euthanasia,Suffering,Cat,Unknown,NaN,Domestic Shorthair,Blue/White
4,A796905,NaN,06/07/2019 10:27:00 AM,06/07/2019 10:27:00 AM,06/07/2017,Euthanasia,Suffering,Other,Unknown,2 years,Raccoon,Black/Gray

In [98]:
shelter_data.columns

Index(['Animal ID', 'Name', 'DateTime', 'MonthYear', 'Date of Birth',
       'Outcome Type', 'Outcome Subtype', 'Animal Type', 'Sex upon Outcome',
       'Age upon Outcome', 'Breed', 'Color'],
      dtype='object')

In [104]:
ulist=shelter_data['Outcome Subtype'].unique()
ulist

array(['Foster', nan, 'Suffering', 'At Vet', 'In Foster', 'Partner',
       'Rabies Risk', 'Snr', 'In Kennel', 'Offsite', 'Behavior',
       'Medical', 'In Surgery', 'Field', 'Customer S', 'Enroute',
       'Underage', 'Barn', 'Aggressive', 'Court/Investigation',
       'Possible Theft', 'SCRP'], dtype=object)

In [117]:
for i in ulist:
    print(shelter_data.loc[shelter_data['Outcome Subtype']==i,['Name','Outcome Subtype']])

                Name Outcome Subtype
0        *Jelly Bean          Foster
32            *Basil          Foster
33          *Caraway          Foster
34           *Fennel          Foster
42             *Mars          Foster
43          *Ambrose          Foster
44               NaN          Foster
45               NaN          Foster
53           *Pepper          Foster
55             *Tony          Foster
56               NaN          Foster
57               NaN          Foster
59               NaN          Foster
60               NaN          Foster
63           *Sophie          Foster
76               Sol          Foster
77             *Juno          Foster
79               NaN          Foster
80            *Betty          Foster
101              NaN          Foster
102              NaN          Foster
134          *Abbott          Foster
135        *Costello          Foster
136              NaN          Foster
182          *Boogie          Foster
220             Narf          Foster
222             Lala          Foster
223         *Giddyup          Foster
224              NaN          Foster
225            *Bell          Foster
...              ...             ...
100632          Lucy          Foster
100712        *Sandy          Foster
100721         Ponyo          Foster
100757       *Thelma          Foster
100810      *Jackson          Foster
100847          Bobo          Foster
100864       *Maddie          Foster
100905         Roxie          Foster
100918         *Gwen          Foster
100923        Oliver          Foster
100924        *Monty          Foster
100934         Sunny          Foster
100935          Lexi          Foster
100943         Peggy          Foster
100944        Albert          Foster
100945       *Cooper          Foster
100952           NaN          Foster
101000         *Lucy          Foster
101054    *Sprinkles          Foster
101061       Toonchi          Foster
101069     *Pop Tart          Foster
101073         *Owen          Foster
101118   *Creamsicle          Foster
101123  *Moon Doggie          Foster
101124          Remi          Foster
101147        Nugget          Foster
101153      *Rooster          Foster
101204       *Margot          Foster
101227         *Hank          Foster
101279       *Dudley          Foster

[7726 rows x 2 columns]
Empty DataFrame
Columns: [Name, Outcome Subtype]
Index: []
              Name Outcome Subtype
2              NaN       Suffering
3              NaN       Suffering
4              NaN       Suffering
90           Rambo       Suffering
165            NaN       Suffering
292        *Laylah       Suffering
381            NaN       Suffering
391            NaN       Suffering
392            NaN       Suffering
412            NaN       Suffering
459            NaN       Suffering
460            NaN       Suffering
461            NaN       Suffering
462            NaN       Suffering
480            NaN       Suffering
483            NaN       Suffering
708           Zara       Suffering
722            NaN       Suffering
819            NaN       Suffering
822            NaN       Suffering
875            NaN       Suffering
974            NaN       Suffering
1021           NaN       Suffering
1024           NaN       Suffering
1149           Cat       Suffering
1163           NaN       Suffering
1164           NaN       Suffering
1223           NaN       Suffering
1232           NaN       Suffering
1233           NaN       Suffering
...            ...             ...
100545         NaN       Suffering
100595     *Minnie       Suffering
100633       Emily       Suffering
100695   Frijolito       Suffering
100698         NaN       Suffering
100700         NaN       Suffering
100716         NaN       Suffering
100726         NaN       Suffering
100734   Fuzzyball       Suffering
100781         NaN       Suffering
100838         NaN       Suffering
100854     *Carrie       Suffering
100865         NaN       Suffering
100883         NaN       Suffering
100885         NaN       Suffering
100886        Rock       Suffering
100917         NaN       Suffering
100920         NaN       Suffering
100926         NaN       Suffering
100928         NaN       Suffering
101105         NaN       Suffering
101138  Miss Kitty       Suffering
101162         NaN       Suffering
101222         NaN       Suffering
101226         NaN       Suffering
101228         NaN       Suffering
101234         NaN       Suffering
101239    *Nutella       Suffering
101248      Stevie       Suffering
101255         NaN       Suffering

[2855 rows x 2 columns]
            Name Outcome Subtype
5            NaN          At Vet
158       Tucker          At Vet
360          *Jo          At Vet
2069         NaN          At Vet
2070      Frisco          At Vet
2105         NaN          At Vet
2794         NaN          At Vet
3140         NaN          At Vet
3315         NaN          At Vet
3352         NaN          At Vet
3525         NaN          At Vet
3543         NaN          At Vet
4831         NaN          At Vet
4832   Susie Lee          At Vet
4833       Nikki          At Vet
4834         NaN          At Vet
5494         NaN          At Vet
5504         NaN          At Vet
6851         NaN          At Vet
7544         NaN          At Vet
8979         NaN          At Vet
8992       Ziggy          At Vet
9135        Milo          At Vet
10050      *Boop          At Vet
10894        NaN          At Vet
11201        NaN          At Vet
11263     *Spice          At Vet
11424     Booyah          At Vet
16384  *Rigatoni          At Vet
16672        NaN          At Vet
...          ...             ...
38809        NaN          At Vet
39000        NaN          At Vet
39681        NaN          At Vet
39794     *Libby          At Vet
39901       Cash          At Vet
39966        NaN          At Vet
40694       Lily          At Vet
41751        NaN          At Vet
42088      Indio          At Vet
43668     Goldie          At Vet
44334        NaN          At Vet
44341     Skippy          At Vet
44893        NaN          At Vet
44986        NaN          At Vet
45164        NaN          At Vet
46522  *Cinnabun          At Vet
49132        NaN          At Vet
49520       Toto          At Vet
50171     Buster          At Vet
53996        Rex          At Vet
55321        NaN          At Vet
60817        NaN          At Vet
61682      *Will          At Vet
62251        NaN          At Vet
66308      Spike          At Vet
75882   Princess          At Vet
89358      *Star          At Vet
90344        NaN          At Vet
90346   *Sherbet          At Vet
95280        NaN          At Vet

[119 rows x 2 columns]
            Name Outcome Subtype
7            NaN       In Foster
8       *Lou Lou       In Foster
351        *Beth       In Foster
423      *Elrond       In Foster
882         Mojo       In Foster
941          NaN       In Foster
946          NaN       In Foster
1116       *Bart       In Foster
1834     *Jasper       In Foster
1911         NaN       In Foster
2302         NaN       In Foster
2407         NaN       In Foster
2531         NaN       In Foster
2532         NaN       In Foster
2641         NaN       In Foster
3387         NaN       In Foster
3456         NaN       In Foster
3546         NaN       In Foster
3686         NaN       In Foster
3793     Roswell       In Foster
3848     *Minnie       In Foster
4235         NaN       In Foster
4361         NaN       In Foster
4390         NaN       In Foster
4393         NaN       In Foster
4537         NaN       In Foster
4766        King       In Foster
5209         NaN       In Foster
10035     *Colby       In Foster
11455        NaN       In Foster
...          ...             ...
87133     *Leroy       In Foster
87384        NaN       In Foster
87518        NaN       In Foster
87681        NaN       In Foster
87738        NaN       In Foster
87878        NaN       In Foster
87930        NaN       In Foster
88333     *Mikey       In Foster
88502        NaN       In Foster
88537        NaN       In Foster
88993      *Mary       In Foster
89397        NaN       In Foster
90284     *Ebbie       In Foster
90345      *Hawk       In Foster
90869      *Wren       In Foster
91104        NaN       In Foster
91710        NaN       In Foster
92224        NaN       In Foster
93850       Bobo       In Foster
94280     Ranger       In Foster
95797      *Vera       In Foster
97778     *Figgy       In Foster
98071        NaN       In Foster
99373    *Noodle       In Foster
99868        NaN       In Foster
99869        NaN       In Foster
99943       Tres       In Foster
100179       NaN       In Foster
101223       NaN       In Foster
101224       NaN       In Foster

[241 rows x 2 columns]
                Name Outcome Subtype
28               NaN         Partner
29               NaN         Partner
30               NaN         Partner
31               NaN         Partner
36             Sadie         Partner
37            *Maven         Partner
38              Elmo         Partner
39            *Michi         Partner
40           *Violet         Partner
49               NaN         Partner
50               NaN         Partner
51               NaN         Partner
52               NaN         Partner
54          *Cosette         Partner
67               NaN         Partner
68               NaN         Partner
69               NaN         Partner
70               NaN         Partner
71               NaN         Partner
72               NaN         Partner
73               NaN         Partner
81               NaN         Partner
85               NaN         Partner
91      Stevie Nicks         Partner
93               NaN         Partner
94               NaN         Partner
96               NaN         Partner
98               NaN         Partner
99               NaN         Partner
100              NaN         Partner
...              ...             ...
101195          Oreo         Partner
101196         *Ajax         Partner
101197      *Roberto         Partner
101198           NaN         Partner
101199           NaN         Partner
101200         Honey         Partner
101202           NaN         Partner
101206           NaN         Partner
101207           NaN         Partner
101208           NaN         Partner
101209           NaN         Partner
101210           NaN         Partner
101211           NaN         Partner
101217           NaN         Partner
101219         Tiger         Partner
101220      *Mirabai         Partner
101230           NaN         Partner
101251           NaN         Partner
101252          Buck         Partner
101253           NaN         Partner
101256           NaN         Partner
101257           NaN         Partner
101258           NaN         Partner
101259           NaN         Partner
101260           NaN         Partner
101273           NaN         Partner
101274           NaN         Partner
101276           NaN         Partner
101277           NaN         Partner
101278           NaN         Partner

[25143 rows x 2 columns]
         Name Outcome Subtype
162       NaN     Rabies Risk
163       NaN     Rabies Risk
164       NaN     Rabies Risk
278       NaN     Rabies Risk
299       NaN     Rabies Risk
375       NaN     Rabies Risk
426       NaN     Rabies Risk
429       NaN     Rabies Risk
431       NaN     Rabies Risk
684       NaN     Rabies Risk
876       NaN     Rabies Risk
877       NaN     Rabies Risk
945       NaN     Rabies Risk
963       NaN     Rabies Risk
993       NaN     Rabies Risk
1002      NaN     Rabies Risk
1007      NaN     Rabies Risk
1028      NaN     Rabies Risk
1230      NaN     Rabies Risk
1295      NaN     Rabies Risk
1296      NaN     Rabies Risk
1297      NaN     Rabies Risk
1495      NaN     Rabies Risk
1505      NaN     Rabies Risk
1677      NaN     Rabies Risk
1699      NaN     Rabies Risk
1728      NaN     Rabies Risk
1863      NaN     Rabies Risk
1916      NaN     Rabies Risk
1969      NaN     Rabies Risk
...       ...             ...
100322    NaN     Rabies Risk
100354    NaN     Rabies Risk
100477    NaN     Rabies Risk
100505    NaN     Rabies Risk
100506    NaN     Rabies Risk
100521    NaN     Rabies Risk
100547    NaN     Rabies Risk
100554    NaN     Rabies Risk
100555    NaN     Rabies Risk
100556    NaN     Rabies Risk
100557    NaN     Rabies Risk
100600    NaN     Rabies Risk
100601    NaN     Rabies Risk
100670    NaN     Rabies Risk
100756    NaN     Rabies Risk
100798    NaN     Rabies Risk
100799    NaN     Rabies Risk
100829    NaN     Rabies Risk
100897    NaN     Rabies Risk
100922    NaN     Rabies Risk
100927    NaN     Rabies Risk
100953    NaN     Rabies Risk
100955    NaN     Rabies Risk
100960  Buddy     Rabies Risk
101059    NaN     Rabies Risk
101095    NaN     Rabies Risk
101155    NaN     Rabies Risk
101159    NaN     Rabies Risk
101176    NaN     Rabies Risk
101225    NaN     Rabies Risk

[3064 rows x 2 columns]
            Name Outcome Subtype
217    *Lavender             Snr
234          NaN             Snr
241          NaN             Snr
312          NaN             Snr
313          NaN             Snr
314       *Vanna             Snr
315          NaN             Snr
493          NaN             Snr
498          NaN             Snr
543          NaN             Snr
547          NaN             Snr
548       *Curry             Snr
549          NaN             Snr
550          NaN             Snr
551          NaN             Snr
552          NaN             Snr
553          NaN             Snr
554          NaN             Snr
555          NaN             Snr
556          NaN             Snr
682          NaN             Snr
686          NaN             Snr
687          NaN             Snr
688          NaN             Snr
689          NaN             Snr
690          NaN             Snr
730          NaN             Snr
841          NaN             Snr
861          NaN             Snr
862         June             Snr
...          ...             ...
36590        NaN             Snr
36633        NaN             Snr
36635  *Franklin             Snr
36697        NaN             Snr
36698        NaN             Snr
36730        NaN             Snr
36757        NaN             Snr
36758        NaN             Snr
36759        NaN             Snr
36760        NaN             Snr
36761        NaN             Snr
36762        NaN             Snr
36833        NaN             Snr
36872        NaN             Snr
36873        NaN             Snr
36878        NaN             Snr
36879        NaN             Snr
36881        NaN             Snr
36882    Whisper             Snr
36883        NaN             Snr
36884        NaN             Snr
36885        NaN             Snr
36887        NaN             Snr
37028        NaN             Snr
37612     Peanut             Snr
43942        NaN             Snr
43944        NaN             Snr
43945      Bubba             Snr
44459        NaN             Snr
44809        NaN             Snr

[1701 rows x 2 columns]
             Name Outcome Subtype
288           NaN       In Kennel
361           NaN       In Kennel
430           NaN       In Kennel
488           NaN       In Kennel
490           NaN       In Kennel
528           NaN       In Kennel
534           NaN       In Kennel
726           NaN       In Kennel
838           NaN       In Kennel
1063          NaN       In Kennel
1068          NaN       In Kennel
1147          NaN       In Kennel
1148          NaN       In Kennel
1228          NaN       In Kennel
1508          NaN       In Kennel
1651          NaN       In Kennel
2212          NaN       In Kennel
2482          NaN       In Kennel
2562          NaN       In Kennel
3103       Beauty       In Kennel
3118          NaN       In Kennel
3381          NaN       In Kennel
3670          NaN       In Kennel
3728         Jude       In Kennel
3971          NaN       In Kennel
4836          NaN       In Kennel
4838          NaN       In Kennel
5215          NaN       In Kennel
5220        Sasha       In Kennel
5614          NaN       In Kennel
...           ...             ...
90227         NaN       In Kennel
90343         NaN       In Kennel
90347       Gizmo       In Kennel
90488         NaN       In Kennel
91576         NaN       In Kennel
91968         NaN       In Kennel
92292         NaN       In Kennel
92518         NaN       In Kennel
92681         NaN       In Kennel
93553         NaN       In Kennel
93900      *Eddie       In Kennel
94449      *Pedro       In Kennel
94918     *Jessie       In Kennel
95625      Jasper       In Kennel
96644         NaN       In Kennel
96679         NaN       In Kennel
98241       Pinto       In Kennel
98302         NaN       In Kennel
98306         NaN       In Kennel
98523         NaN       In Kennel
98884         NaN       In Kennel
99261        *Max       In Kennel
99784         NaN       In Kennel
99949         NaN       In Kennel
100102        NaN       In Kennel
100229     Dillon       In Kennel
100762        NaN       In Kennel
100763        NaN       In Kennel
101024  *Choochoo       In Kennel
101262        NaN       In Kennel

[473 rows x 2 columns]
             Name Outcome Subtype
397           NaN         Offsite
8416     *Delilah         Offsite
9384    Jeffrey G         Offsite
9651      Truffle         Offsite
11279     *Sawyer         Offsite
11556       Clyde         Offsite
11561        Lola         Offsite
12096    *Giselle         Offsite
15218      *Pilot         Offsite
16361         Dax         Offsite
18657   *Midnight         Offsite
19844        Nina         Offsite
23847     *Nutmeg         Offsite
24570      Sammie         Offsite
24571       Oscar         Offsite
24577        Sage         Offsite
29039       Silas         Offsite
29051      Louisa         Offsite
29052    *Mooshoo         Offsite
29054      *Mouse         Offsite
29055    *Tom Yum         Offsite
29058         Tut         Offsite
29059    *Sheriff         Offsite
29064      *Mochi         Offsite
29065     *Clover         Offsite
29068      Copper         Offsite
29072      *Alamo         Offsite
29073     *Sloane         Offsite
29074         NaN         Offsite
29076    Achilles         Offsite
...           ...             ...
96024      Austin         Offsite
96509        *Ava         Offsite
96537   *Emmaline         Offsite
96541       Chico         Offsite
97629      *Spice         Offsite
97630       *Iota         Offsite
97870      *Fiona         Offsite
98003        *Moe         Offsite
98004       *Mary         Offsite
98347      *Gilly         Offsite
98349       Lucky         Offsite
98844    *Shelley         Offsite
98846     *Bonnie         Offsite
99055     *Smidge         Offsite
99056       *Tiny         Offsite
99057      *Micro         Offsite
99376   *Lil Baby         Offsite
99377   *Adelaide         Offsite
99378    *Harmony         Offsite
99379     *Stubbs         Offsite
99635    *Davinci         Offsite
99713    *Skipper         Offsite
99714       *Alex         Offsite
100626    *Cookie         Offsite
100629      *Ella         Offsite
100636    *Alexei         Offsite
100970   *Tatiana         Offsite
101021    Stanley         Offsite
101028     *Maria         Offsite
101030     *Puffy         Offsite

[379 rows x 2 columns]

             Name Outcome Subtype
906         Vinny        Behavior
5385        Levon        Behavior
5387       Smokey        Behavior
6529        Bruno        Behavior
9074         Zeus        Behavior
29122    King Max        Behavior
29123      Pepper        Behavior
34242    Springer        Behavior
34253       Snoop        Behavior
41741         Leo        Behavior
45971       Teddy        Behavior
47890       Gucci        Behavior
54142        Boss        Behavior
56301        Abel        Behavior
63268        Baby        Behavior
67252         NaN        Behavior
69432     *Cooper        Behavior
72183        Maia        Behavior
72309       Molly        Behavior
72909     *Fergie        Behavior
73103     Zuester        Behavior
73439        Skit        Behavior
73520       Lucky        Behavior
74687       Major        Behavior
75109      *Dixie        Behavior
75220      Thiago        Behavior
76369      Cooper        Behavior
77966         NaN        Behavior
78571       Zorro        Behavior
78614         NaN        Behavior
...           ...             ...
97224      Lluvia        Behavior
97455     Crystal        Behavior
97458      *Leroy        Behavior
97779     Ricardo        Behavior
97803         NaN        Behavior
97807         NaN        Behavior
97946       Tyson        Behavior
98419    *Jasmine        Behavior
98500       Rocky        Behavior
98510     Diamond        Behavior
98511     *Tucker        Behavior
98516       Conan        Behavior
98807         Rex        Behavior
98934   *Allaster        Behavior
98970     Bubbles        Behavior
98972    Sherlock        Behavior
98975     *Willie        Behavior
99199         *Oz        Behavior
99536      *Percy        Behavior
99538    *Preston        Behavior
99778        Tank        Behavior
99780       Rosco        Behavior
99804      *Ollie        Behavior
99970     *Marcos        Behavior
100341      *Cody        Behavior
100831     *Tessa        Behavior
101067   *Mallory        Behavior
101068     Archie        Behavior
101188        NaN        Behavior
101268       Deco        Behavior

[147 rows x 2 columns]
                Name Outcome Subtype
937           Avalon         Medical
1231             NaN         Medical
1273             NaN         Medical
1427             NaN         Medical
1503       *Marzipan         Medical
2166          Boomer         Medical
2566             NaN         Medical
2927             NaN         Medical
2935             NaN         Medical
3168             NaN         Medical
3242             NaN         Medical
5279    Elliot Pound         Medical
6263             NaN         Medical
6454        *Toodles         Medical
7616             NaN         Medical
7661             NaN         Medical
7703             NaN         Medical
7861             NaN         Medical
8479            Zeke         Medical
8786             NaN         Medical
11536            NaN         Medical
11806            NaN         Medical
13168            NaN         Medical
14452            NaN         Medical
14694            NaN         Medical
15203            NaN         Medical
15461          *Hope         Medical
15775            NaN         Medical
20188            Max         Medical
20765            NaN         Medical
...              ...             ...
93868            NaN         Medical
93924            NaN         Medical
94037        Natasha         Medical
94146            NaN         Medical
94558            NaN         Medical
94559            NaN         Medical
94582            NaN         Medical
94583            NaN         Medical
95497          Kinda         Medical
95743            NaN         Medical
96251         Nestle         Medical
96300            NaN         Medical
96323            NaN         Medical
97359            NaN         Medical
97441            NaN         Medical
98171            NaN         Medical
98290            NaN         Medical
98291            NaN         Medical
98303            NaN         Medical
98304            NaN         Medical
98494        *Julian         Medical
98761            NaN         Medical
98809            NaN         Medical
99074            NaN         Medical
99698        *Harvey         Medical
100065           NaN         Medical
100954           NaN         Medical
101240           NaN         Medical
101249         Trudy         Medical
101250         Hooch         Medical

[297 rows x 2 columns]
            Name Outcome Subtype
1126         NaN      In Surgery
1442         NaN      In Surgery
3821       Teddy      In Surgery
14409        NaN      In Surgery
23004        NaN      In Surgery
28075        NaN      In Surgery
28500     *Pearl      In Surgery
31957      Tramp      In Surgery
32900        NaN      In Surgery
35763    *Hester      In Surgery
37672  *Franklin      In Surgery
42763    Gunther      In Surgery
43037   *Sparrow      In Surgery
49420        NaN      In Surgery
52438     *Harry      In Surgery
56348        NaN      In Surgery
69782        NaN      In Surgery
70848      Candy      In Surgery
95395        NaN      In Surgery
95811       Otto      In Surgery
96874        NaN      In Surgery
        Name Outcome Subtype
1394     Oso           Field
2369  Gracie           Field
6333     NaN           Field
      Name Outcome Subtype
1743  Coco      Customer S
          Name Outcome Subtype
2310       NaN         Enroute
2677     Gibby         Enroute
3195       NaN         Enroute
3350       NaN         Enroute
9583       NaN         Enroute
11141      NaN         Enroute
11861      NaN         Enroute
12632      NaN         Enroute
14479      NaN         Enroute
14481      NaN         Enroute
18954      NaN         Enroute
19665      NaN         Enroute
19777      NaN         Enroute
20686      NaN         Enroute
21150      NaN         Enroute
21706      NaN         Enroute
21716      NaN         Enroute
22364   Spanky         Enroute
24028      NaN         Enroute
26063      NaN         Enroute
27514      NaN         Enroute
32003      NaN         Enroute
32142      NaN         Enroute
32243      NaN         Enroute
32496      NaN         Enroute
33541      NaN         Enroute
33542      NaN         Enroute
33543      NaN         Enroute
33561      NaN         Enroute
34631      NaN         Enroute
...        ...             ...
38714  Patches         Enroute
38992      NaN         Enroute
38993      NaN         Enroute
38994      NaN         Enroute
41015      NaN         Enroute
44682      NaN         Enroute
46068      NaN         Enroute
49471      NaN         Enroute
51141      NaN         Enroute
53421     Trap         Enroute
59823      Sam         Enroute
61371      NaN         Enroute
62272      NaN         Enroute
64108      NaN         Enroute
66143      NaN         Enroute
66929      NaN         Enroute
71564      NaN         Enroute
74733      NaN         Enroute
86601      NaN         Enroute
86643      NaN         Enroute
88499      NaN         Enroute
89400      NaN         Enroute
89739      NaN         Enroute
90921      NaN         Enroute
92548      NaN         Enroute
93388      NaN         Enroute
94543   Kimmie         Enroute
96161      NaN         Enroute
96771      NaN         Enroute
98599      NaN         Enroute

[63 rows x 2 columns]
      Name Outcome Subtype
2611   NaN        Underage
32099  NaN        Underage
35384  NaN        Underage
48665  NaN        Underage
53457  NaN        Underage
53491  NaN        Underage
53492  NaN        Underage
53493  NaN        Underage
53494  NaN        Underage
53495  NaN        Underage
53496  NaN        Underage
53497  NaN        Underage
53498  NaN        Underage
53499  NaN        Underage
53500  NaN        Underage
53501  NaN        Underage
54213  NaN        Underage
54214  NaN        Underage
54215  NaN        Underage
54216  NaN        Underage
54217  NaN        Underage
54218  NaN        Underage
54219  NaN        Underage
72830  NaN        Underage
72831  NaN        Underage
72832  NaN        Underage
72833  NaN        Underage
72834  NaN        Underage
72836  NaN        Underage
         Name Outcome Subtype
3423    *Fred            Barn
38746  Ginger            Barn
77063   Percy            Barn
83311     NaN            Barn
              Name Outcome Subtype
3955          Jake      Aggressive
4711         Tyler      Aggressive
4976          Duke      Aggressive
5297        Fenrir      Aggressive
5298           Tex      Aggressive
5350         Cecil      Aggressive
6185          Tiny      Aggressive
6188        Junior      Aggressive
12752        Mateo      Aggressive
18371       Gunner      Aggressive
21125         Bear      Aggressive
23034         Kash      Aggressive
24939       Willie      Aggressive
27585      Hustler      Aggressive
28255       Minnie      Aggressive
32957       Bonbon      Aggressive
40003        Danny      Aggressive
40305        Ralph      Aggressive
40578       Capone      Aggressive
42477         Zeus      Aggressive
42639          Dro      Aggressive
42983         Milo      Aggressive
43354         King      Aggressive
43359         Sumo      Aggressive
44710          Taz      Aggressive
45473    Alexander      Aggressive
46559       Arthur      Aggressive
47016   Chichi Boy      Aggressive
47766       Jordan      Aggressive
48513      Leonard      Aggressive
...            ...             ...
99152        *July      Aggressive
99276         Blou      Aggressive
99277       *Emmit      Aggressive
99340          NaN      Aggressive
99431       Cookie      Aggressive
99433         Cece      Aggressive
99485         Toby      Aggressive
99625       Maddie      Aggressive
99694          NaN      Aggressive
99788         Kilo      Aggressive
99806       Marley      Aggressive
99884         Nala      Aggressive
99930       *Bruce      Aggressive
99931      *Thauti      Aggressive
99968     Africano      Aggressive
100017      Brutus      Aggressive
100019        Coco      Aggressive
100020     *Wilbur      Aggressive
100021        Jedi      Aggressive
100291       *Gabe      Aggressive
100317     *Marley      Aggressive
100318    *Petunia      Aggressive
100729       Terra      Aggressive
100839         NaN      Aggressive
100846        Boss      Aggressive
100848      *Dusty      Aggressive
100996       Vegas      Aggressive
101110       Crash      Aggressive
101113     *Dodger      Aggressive
101266       *Gage      Aggressive

[518 rows x 2 columns]

            Name      Outcome Subtype
22267      Mocha  Court/Investigation
22268       Baby  Court/Investigation
22269      Rusty  Court/Investigation
22270      Bruce  Court/Investigation
22271      Buddy  Court/Investigation
33513      Cocoa  Court/Investigation
33515     Cowboy  Court/Investigation
33518      Bella  Court/Investigation
47965       Odin  Court/Investigation
54594       Rudy  Court/Investigation
56387   Princess  Court/Investigation
57358       Coco  Court/Investigation
60829       King  Court/Investigation
61012       Damu  Court/Investigation
64655      Brick  Court/Investigation
70567      Sasha  Court/Investigation
73460      Tyson  Court/Investigation
75809       Coby  Court/Investigation
79466       King  Court/Investigation
82738      Bella  Court/Investigation
85521      Sissy  Court/Investigation
100101     Chako  Court/Investigation
100310     Gotti  Court/Investigation
            Name Outcome Subtype
28563    Stanley  Possible Theft
35183      Buddy  Possible Theft
47743  *Sapphire  Possible Theft
61759     Twiggy  Possible Theft
64750      Sasha  Possible Theft
69498  *Amarillo  Possible Theft
72949  *Amarillo  Possible Theft
74521   Reginald  Possible Theft
97941      *Iris  Possible Theft
           Name Outcome Subtype
37125       NaN            SCRP
37170   Whiskey            SCRP
37329       NaN            SCRP
37366       NaN            SCRP
37413       NaN            SCRP
37506       NaN            SCRP
37507     Zelda            SCRP
37559       NaN            SCRP
37560       NaN            SCRP
37561       NaN            SCRP
37652       NaN            SCRP
37653       NaN            SCRP
37690       NaN            SCRP
37708       NaN            SCRP
37709      Mimi            SCRP
37747       NaN            SCRP
37748       NaN            SCRP
37839       NaN            SCRP
37876       NaN            SCRP
37877       NaN            SCRP
37948       NaN            SCRP
37993       NaN            SCRP
37994       NaN            SCRP
38088       NaN            SCRP
38089       NaN            SCRP
38190       NaN            SCRP
38223       NaN            SCRP
38224       NaN            SCRP
38225       NaN            SCRP
38302       NaN            SCRP
...         ...             ...
100788    Taboo            SCRP
100789      NaN            SCRP
100790      NaN            SCRP
100791      NaN            SCRP
100946      NaN            SCRP
100947      NaN            SCRP
100948      NaN            SCRP
100949      NaN            SCRP
100950      NaN            SCRP
100984      NaN            SCRP
101004      NaN            SCRP
101005      NaN            SCRP
101006      NaN            SCRP
101139      NaN            SCRP
101140      NaN            SCRP
101141      NaN            SCRP
101142      NaN            SCRP
101143      NaN            SCRP
101144      NaN            SCRP
101145      NaN            SCRP
101154      NaN            SCRP
101156      NaN            SCRP
101157      NaN            SCRP
101158      NaN            SCRP
101163      NaN            SCRP
101164      NaN            SCRP
101165      NaN            SCRP
101235   Amalia            SCRP
101242      NaN            SCRP
101243      NaN            SCRP

[3211 rows x 2 columns]

In [118]:
for i in ulist:
    print(shelter_data.loc[(shelter_data['Outcome Subtype']==i) & (shelter_data['Outcome Type']=='Adoption'),['Animal Type']]

SyntaxError: unexpected EOF while parsing (<ipython-input-118-e17440b681b0>, line 2)

In [122]:
new = shelter_data.loc[(shelter_data['Outcome Subtype']=='Foster') & (shelter_data['Outcome Type']=='Adoption') & (shelter_data['Animal Type']=='Cat'),['Animal Type']]
new

       Animal Type
32             Cat
33             Cat
34             Cat
42             Cat
43             Cat
44             Cat
45             Cat
53             Cat
55             Cat
56             Cat
57             Cat
59             Cat
60             Cat
63             Cat
77             Cat
101            Cat
102            Cat
134            Cat
135            Cat
494            Cat
495            Cat
496            Cat
497            Cat
535            Cat
536            Cat
537            Cat
538            Cat
539            Cat
540            Cat
611            Cat
...            ...
100018         Cat
100104         Cat
100105         Cat
100106         Cat
100134         Cat
100159         Cat
100197         Cat
100198         Cat
100240         Cat
100268         Cat
100332         Cat
100333         Cat
100353         Cat
100599         Cat
100632         Cat
100864         Cat
100918         Cat
100923         Cat
100924         Cat
100943         Cat
100944         Cat
101000         Cat
101054         Cat
101061         Cat
101069         Cat
101073         Cat
101118         Cat
101124         Cat
101147         Cat
101204         Cat

[4315 rows x 1 columns]

## Assessment & Reflection

- One thing you did not know before?
- Two things you want to remember?
- One thing you're still confused by?